import type { Faq } from "../index.ts";

export default {
  locale: "tw",
  faq: [
    {
      title: "飲食如何？",
      answer:
        "我們將安排足夠的伙食，包含三餐、零食、飲料、麵包等，也將設置食物吧檯讓參賽者自由取用，確保參賽者能適時補充能量！",
    },
    {
      title: "住宿呢？",
      answer: "我們會承包住宿！我們會安排住宿讓你睡上美美的一覺~",
    },
    {
      title: "有車票補助嗎？",
      answer:
        "Hack Club 可能會給補助喔！但詳細資訊還是要等待 Hack Club 發布更詳細的消息~<br>若有最新資訊，將即時更新在官網",
    },
    {
      title: "低收入還要繳費嗎？",
      answer: "我們還在跟贊助商協商中！有進度將第一時間通知於官網上",
    },
    {
      title: "一定要到現場嗎？",
      answer:
        "本次活動，參賽者將在現場與夥伴創造出自己獨一無二的作品，所以一定要到現場喔！",
    },
    {
      title: "什麼時候開始報名？",
      answer: "報名系統將於 2/11 啟動！最新消息都將會公布於官網上",
    },
    {
      title: "我怎麼知道我們被選上了？",
      answer: "入選名單將會於 3/5 公布於官網，請隨時關注官網的最新消息喔！",
    },
    {
      title: "你們值得信任嗎？",
      answer:
        "雖然我們只是一群高中生，但每個人都有豐富的相關背景和經歷。<br>我們也與政府機關和美國的Hack Club合作，是跟普拿疼一樣可以信任的存在！",
    },
    {
      title: "可以去半天嗎？",
      answer:
        "本次活動的形式為過夜制，黑客時間的安排也是兩天的時間，需要活動兩天都在場",
    },
    {
      title: "題目是什麼？",
      answer:
        "本次活動為了鼓勵創意和實驗精神，挑戰自我，打造最具創新、搞笑或不拘一格的專案，所以是不限制任何主題和題目的喔！",
    },
    {
      title: "誰可以參加？",
      answer:
        "只要你/妳是處於高中教育階段的學生，也對程式設計有興趣，不管你/妳有沒有經驗，我們都非常歡迎你/妳的加入喔！",
    },
    {
      title: "可以幾個人參加？",
      answer:
        "本次活動是以隊伍為形式報名，一組限制為 4 至 5 人！不過如果你/妳對參加比賽很有意願，歡迎加入我們的官方 Discord 社群，在裡面內尋找屬於你/妳的夥伴喔！",
    },
    {
      title: "指導老師一定要嗎？",
      answer:
        "活動期間全程皆有工作人員在現場，也不強制指導老師在場，但為了保障參賽者的安全，還是建議指導老師全程陪同喔！",
    },
    {
      title: "父母可以來嗎？",
      answer:
        "由於場地配置問題，本次活動沒有特別安排給家長休息的空間，我們對此感到很遺憾。若如果家長任何有擔憂，都歡迎來信詢問或是與我們聯繫",
    },
    {
      title: "指導老師可以來嗎？",
      answer: "現場會安排指導老師的休息區供老師們休息，指導老師是可以來的喔！",
    },
    {
      title: "現場有成人監督嗎？",
      answer:
        "HackIt 團隊雖然都是高中生，不過也有已經成年的夥伴，現場也會有工作人員與指導老師全程陪同，請不用擔心！",
    },
  ],
} satisfies Faq;
